Revit 2026 API

# FailuresAccessorResolveFailures Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ResolveFailures(
	IList<FailureMessageAccessor> failures
)
```
```vb
Public Sub ResolveFailures (
	failures As IList(Of FailureMessageAccessor)
)
```
```cpp
public:
void ResolveFailures(
	IList<FailureMessageAccessor^>^ failures
)
```
```fsharp
member ResolveFailures :
        failures : IList<FailureMessageAccessor> -> unit
```

#### Parameters

failures IListFailureMessageAccessor

#### Reference

FailuresAccessor Class

Autodesk.Revit.DB Namespace